papers/cdc19.html
---
layout: page
title: Game Theoretical Approach to Sequential Hypothesis Test with Byzantine Sensors 
---
<hr>

<p>
<b>ZiShuo Li, Yilin Mo and Fei Hao</b>
</p>

<p>
<i>IEEE Conference on Decision and Control</i>, Nice, France, Dec 11-13, 2019
</p>

<p>
Link to the <a href="../../../public/papers/cdc19.pdf">paper</a>
</p>

<div id="outline-container-org9aa080a" class="outline-2">
<h2 id="org9aa080a">Abstract</h2>
<div class="outline-text-2" id="text-org9aa080a">
<p>
In this paper, we consider the problem of sequential binary hypothesis test in adversary environment based on observations from \(s\) sensors, with the caveat that a subset of \(c\) sensors is compromised by an adversary, whose observations can be manipulated arbitrarily. We choose the asymptotic Average Sample Number (ASN) required to reach a certain level of error probability as the performance metric of the system. The problem is cast as a game between the detector and the adversary, where the detector aims to optimize the system performance while the adversary tries to deteriorate it. We propose a pair of flip attack strategy and voting hypothesis testing rule and prove that they form an equilibrium strategy pair for the game. We further investigate the performance of our proposed detection scheme with unknown number of compromised sensors and corroborate our result with simulation.
</p>
</div>
</div>
